research/research-interests/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-16 Sat 06:37 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Venkatesh Choppella:  Research Interests</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="content">
<h1 class="title">Venkatesh Choppella:  Research Interests</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf926dcc">1. Background</a>
<ul>
<li><a href="#org53184bf">1.1. Degrees and Pedigree</a></li>
<li><a href="#orgc57c4cb">1.2. Industry</a></li>
<li><a href="#org750ab88">1.3. Research Positions</a></li>
<li><a href="#org6814a26">1.4. Information Technology</a></li>
</ul>
</li>
<li><a href="#org6b767b9">2. Capsule Research Interests</a></li>
<li><a href="#orge2d2bcf">3. Current Research Interests</a>
<ul>
<li><a href="#orgb6f8bd3">3.1. Computer Science</a></li>
<li><a href="#org1e911ae">3.2. Software Engineering</a>
<ul>
<li><a href="#org1e4af48">3.2.1. HCI</a></li>
<li><a href="#orgc45e5fb">3.2.2. Web Security</a></li>
<li><a href="#org566f5f5">3.2.3. Component verification in embedded real time systems</a></li>
<li><a href="#org4e8a6ff">3.2.4. Workflow systems</a></li>
</ul>
</li>
<li><a href="#org7f6f167">3.3. Technology</a>
<ul>
<li><a href="#orgc0287f0">3.3.1. Educational Technologies</a></li>
<li><a href="#org8522e01">3.3.2. Web Accessibility</a></li>
<li><a href="#org9ed69af">3.3.3. Virtual Lab for Hindustani Classical Music</a></li>
</ul>
</li>
<li><a href="#org5d18fd4">3.4. Pedagogy</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf926dcc" class="outline-2">
<h2 id="orgf926dcc"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org53184bf" class="outline-3">
<h3 id="org53184bf"><span class="section-number-3">1.1</span> Degrees and Pedigree</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A BTech in CSE from IITK, MTech from IITM and a PhD in CSE from
Indiana Univ. In my PhD I investigated automatic proof generation for
Errors in type systems and term unification.  My advisor was Chris
Haynes. 
</p>

<p>
My interests in Programming Languages began at IITM where I studied
the programming language ML, guided by Prof. C R Muthukrishnan.
</p>

<p>
The department at IU was strong in Functional Programming in Scheme,
and Programming language semantics and Logic.  That has influenced the
way I think about programs and Software.  The other influence was
static type systems and formal verification.
</p>
</div>
</div>

<div id="outline-container-orgc57c4cb" class="outline-3">
<h3 id="orgc57c4cb"><span class="section-number-3">1.2</span> Industry</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I've done a few stints in the Industry.   Hands on with research
technologies. 
</p>

<dl class="org-dl">
<dt>Derivation Systems (95-97)</dt><dd>Worked at a NASA-funded startup.
Verified a transformation system for generating digital
circuits using PVS.  Actually got paid for proving theorems!</dd>
</dl>


<dl class="org-dl">
<dt>Xerox Corporation (97-99)</dt><dd>Worked as part of the Aspect
Oriented Programming team at PARC.   Then moved to their
product division and worked with their forms-based products.</dd>

<dt>Hewlett Packard</dt><dd>Worked on building Java Web Services.</dd>
</dl>
</div>
</div>

<div id="outline-container-org750ab88" class="outline-3">
<h3 id="org750ab88"><span class="section-number-3">1.3</span> Research Positions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
After my PhD I did switched to compliers for high performance
computing.  This took me to Oak Ridge and Ohio State, where I was part
of a team that built a compiler to transform tensor equations to
Fortran(!).  This compiler was in the service of Chemistry researches
doing ab initio quantum chemistry.  
</p>
</div>
</div>

<div id="outline-container-org6814a26" class="outline-3">
<h3 id="org6814a26"><span class="section-number-3">1.4</span> Information Technology</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In 2003 I returned to India (IIITMK Thiruvananthapuram) to switch to
Information Technology.  I plunged into <i>doing</i> systems: everything
from systems administration to networks and web applications and
portals.
</p>

<p>
The place was small, so we got to experiment a lot with teaching
(E.g., in the networking course, the class got to study and rebuild
the institute's firewall.)  I discovered new ways to teach Programming
(Javascript and Scheme together.  Intro programming and Browser
applications, in 2007).   
</p>

<p>
In 2010 I moved to IIIT-H.   The atmosphere for research was great,
and I got a chance to get back to many research areas that I had held
at abeyance. 
</p>
</div>
</div>
</div>


<div id="outline-container-org6b767b9" class="outline-2">
<h2 id="org6b767b9"><span class="section-number-2">2</span> Capsule Research Interests</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>Programming Languages</dt><dd>Type systems, Program Transformation,
Applications of Process algebras to model workflows (Session
types).</dd>

<dt>Formal Methods for S/W Engg</dt><dd>Component verification in Real-time
systems using model checkers like UPPAAL.  Theorem provers for
industrial use (Event B) .  Modeling of Web browser security
using Alloy.  Systematic and semantics based re-engineering and
transformation of code.</dd>

<dt>(no term)</dt><dd>Web Accessibility:: Web Re-narration (Alipi) and Semantic tweets.</dd>

<dt>Pedagogy</dt><dd>Algo-dynamics, Functional Programming (Scheme plus
Javascript), Definitional interpreters for programming
languages.</dd>

<dt>Educational Technologies</dt><dd>Virtual Labs design, development and
deployment.</dd>
</dl>
</div>
</div>


<div id="outline-container-orge2d2bcf" class="outline-2">
<h2 id="orge2d2bcf"><span class="section-number-2">3</span> Current Research Interests</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb6f8bd3" class="outline-3">
<h3 id="orgb6f8bd3"><span class="section-number-3">3.1</span> Computer Science</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In computer science, my main interest has centred around the study of
Programming Languages.  For my PhD I worked on the problem of
automatic proof generation of unification (CADE 2003, Information and
Computation 2005) and their application to debugging errors in type
systems (IFL 2003). 
</p>

<p>
In the last few years, I have spent time trying to understand the
structure of concurrency from a formal perspective.  I have studied
CCS, Pi Calculus and Bisimulation.
</p>

<p>
Rather than contribute to the theory of concurrency, my research
interests are about their practical applications of process theory to
diverse domains, often called Formal Methods.  Some of the application
domains we have investigated are listed below.
</p>

<dl class="org-dl">
<dt>Human Computer Interaction</dt><dd>My interest here is the formal
specification of interactive behaviour of devices, their use
cases and the user models of these devices.   We have
conducted  empirical studies on impact of changing interface
versus functionality (
interface versus See our recent
work in CHI 2014 about bisimulation models for user models.</dd>

<dt>Workflows</dt><dd>The problem we have studied the specification of
workflows and state based access control in these
workflows.  We have presented models of workflows in
Education (T4E 2012), and in E-governance
(ICEGOV 2013).</dd>
</dl>
</div>
</div>


<div id="outline-container-org1e911ae" class="outline-3">
<h3 id="org1e911ae"><span class="section-number-3">3.2</span> Software Engineering</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Formal Methods for the specification and development of software.
Understanding systems and processes. 
</p>
</div>

<div id="outline-container-org1e4af48" class="outline-4">
<h4 id="org1e4af48"><span class="section-number-4">3.2.1</span> HCI</h4>
</div>

<div id="outline-container-orgc45e5fb" class="outline-4">
<h4 id="orgc45e5fb"><span class="section-number-4">3.2.2</span> Web Security</h4>
</div>

<div id="outline-container-org566f5f5" class="outline-4">
<h4 id="org566f5f5"><span class="section-number-4">3.2.3</span> Component verification in embedded real time systems</h4>
</div>
<div id="outline-container-org4e8a6ff" class="outline-4">
<h4 id="org4e8a6ff"><span class="section-number-4">3.2.4</span> Workflow systems</h4>
</div>
</div>

<div id="outline-container-org7f6f167" class="outline-3">
<h3 id="org7f6f167"><span class="section-number-3">3.3</span> Technology</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orgc0287f0" class="outline-4">
<h4 id="orgc0287f0"><span class="section-number-4">3.3.1</span> Educational Technologies</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Development and Engineering of Virtual Labs.  Evangelizing Open Source
technologies, specially Emacs, Org-mode
</p>
</div>
</div>

<div id="outline-container-org8522e01" class="outline-4">
<h4 id="org8522e01"><span class="section-number-4">3.3.2</span> Web Accessibility</h4>
</div>

<div id="outline-container-org9ed69af" class="outline-4">
<h4 id="org9ed69af"><span class="section-number-4">3.3.3</span> Virtual Lab for Hindustani Classical Music</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
Technologies to support  pedagogy for Hindustani Classical Music
</p>
</div>
</div>
</div>

<div id="outline-container-org5d18fd4" class="outline-3">
<h3 id="org5d18fd4"><span class="section-number-3">3.4</span> Pedagogy</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Principles of Programming</li>

<li>Principles of Programming Languages: EoPL</li>

<li>Functional Programming in Racket/Scheme</li>

<li>Ideas from Control Systems to Understand S/W Systems</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-12-16 Sat 06:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
